In [1]:
#Pandas 
import pandas as pd

In [12]:
dataset = {'cars': ['Honda', 'Toyota', 'Mazda'], 'numbers': [1,2,3]}
df = pd.DataFrame(dataset) #Dataframe is a 2 dimensional data structure or a table with rows and columns
df

     cars  numbers
0   Honda        1
1  Toyota        2
2   Mazda        3

In [14]:
print(df.loc[0]) # use to return 1 specified row

cars       Honda
numbers        1
Name: 0, dtype: object

In [22]:
df.loc[[0,2]]

    cars  numbers
0  Honda        1
2  Mazda        3

In [29]:
dataset2 = {'Name': ['Jose', 'Maria', 'John'], 'Age': [25,26,27]}
df1 = pd.DataFrame(dataset2, index=['Agent 1', 'Agent 2', 'Agent 3']) #added index
df1

          Name  Age
Agent 1   Jose   25
Agent 2  Maria   26
Agent 3   John   27

In [33]:
df1.loc['Agent 1'] #look up to see the row under Agent 1

Name    Jose
Age       25
Name: Agent 1, dtype: object

In [11]:
a = [1,2,3,4]
my_series = pd.Series(a)
my_series

0    1
1    2
2    3
3    4
dtype: int64

In [36]:
df3 = pd.read_csv('karamba')# reading csv files
df3

   Unnamed: 0   0
0           0  10
1           1  20
2           2  30

In [40]:
df3.head() #check the first 5

   Unnamed: 0   0
0           0  10
1           1  20
2           2  30

In [41]:
df3.tail() #check the last 5

   Unnamed: 0   0
0           0  10
1           1  20
2           2  30

In [42]:
df3.info() #give informative detail

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  3 non-null      int64
 1   0           3 non-null      int64
dtypes: int64(2)
memory usage: 176.0 bytes

In [44]:
df3.dropna() #drop all null values in the table
df3.dropna(inplace = True) #drop all null values and replace it

In [48]:
df['cars'].dropna()

0     Honda
1    Toyota
2     Mazda
Name: cars, dtype: object